app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "note", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-21 07:47:32.176345"], ["note", "Go for Jogging"], ["title", "Wake Up"], ["updated_at", "2014-12-21 07:47:32.176345"]]
---
	def create
  		@article = Article.new(article_params)

      if @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
---
  def update
    @article = Article.find(params[:id])